intyg/clinicalprocess-healthcond-certificate/schemas/interactions/SendCertificateToRecipientInteraction/SendCertificateToRecipientInteraction_1.0_RIVTABP21.wsdl

<?xml version="1.0" encoding="UTF-8" ?>
<!--
  ~ Copyright (C) 2015 Inera AB (http://www.inera.se)
  ~
  ~ This file is part of sklintyg (https://github.com/sklintyg).
  ~
  ~ sklintyg is free software: you can redistribute it and/or modify
  ~ it under the terms of the GNU General Public License as published by
  ~ the Free Software Foundation, either version 3 of the License, or
  ~ (at your option) any later version.
  ~
  ~ sklintyg is distributed in the hope that it will be useful,
  ~ but WITHOUT ANY WARRANTY; without even the implied warranty of
  ~ MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
  ~ GNU General Public License for more details.
  ~
  ~ You should have received a copy of the GNU General Public License
  ~ along with this program.  If not, see <http://www.gnu.org/licenses/>.
  -->

<!--
 Licensed to the Apache Software Foundation (ASF) under one
 or more contributor license agreements. See the NOTICE file
 distributed with this work for additional information
 regarding copyright ownership. Sveriges Kommuner och Landsting licenses this file
 to you under the Apache License, Version 2.0 (the
 "License"); you may not use this file except in compliance
 with the License. You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing,
 software distributed under the License is distributed on an
 "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 KIND, either express or implied. See the License for the
 specific language governing permissions and limitations
 under the License.
 -->
<wsdl:definitions name='SendCertificateToRecipientInteraction' xmlns:wsdl='http://schemas.xmlsoap.org/wsdl/'
                  xmlns:soap='http://schemas.xmlsoap.org/wsdl/soap/' xmlns:xs='http://www.w3.org/2001/XMLSchema'
                  xmlns:tjsr='urn:riv:clinicalprocess:healthcond:certificate:SendCertificateToRecipientResponder:1'
                  xmlns:tns='urn:riv:clinicalprocess:healthcond:certificate:SendCertificateToRecipient:1:rivtabp21'
                  targetNamespace='urn:riv:clinicalprocess:healthcond:certificate:SendCertificateToRecipient:1:rivtabp21'
                  xmlns:itr='urn:riv:itintegration:registry:1'>
  <xs:annotation>
    <xs:documentation>
      Tjänsteinteraktionens namn: SendCertificateToRecipientInteraction
      Beskrivning:
      Interaktion för att skicka ett intyg till en mottagare.
      Revisioner:
      2013-11-24: Utkast Version 1.0, mats.ekhammar@callistaenterprise.se
      Tjänstedomän: clinicalprocess:healthcond:certificate
      Tjänsteinteraktionstyp: Intyg
      WS-profil: RIVTABP21
      2015-03-11: Namnändrat från SendCertificateForCitizen
      Tjänstedomän: clinicalprocess:healthcond:certificate
      Tjänsteinteraktionstyp: Intyg
      WS-profil: RIVTABP21
    </xs:documentation>
  </xs:annotation>
  <wsdl:types>
    <xs:schema targetNamespace='urn:riv:clinicalprocess:healthcond:certificate:SendCertificateToRecipient:1:rivtabp21'>
      <xs:import schemaLocation='./SendCertificateToRecipientResponder_1.0.xsd' namespace='urn:riv:clinicalprocess:healthcond:certificate:SendCertificateToRecipientResponder:1'/>
      <xs:import schemaLocation='../../core_components/itintegration_registry_1.0.xsd' namespace='urn:riv:itintegration:registry:1'/>
    </xs:schema>
  </wsdl:types>
  <wsdl:message name='SendCertificateToRecipientRequest'>
    <wsdl:part name='LogicalAddress' element='itr:LogicalAddress'>
    </wsdl:part>
    <wsdl:part name='parameters' element='tjsr:SendCertificateToRecipient'/>
  </wsdl:message>
  <wsdl:message name='SendCertificateToRecipientResponse'>
    <wsdl:part name='parameters' element='tjsr:SendCertificateToRecipientResponse'/>
  </wsdl:message>
  <wsdl:portType name='SendCertificateToRecipientResponderInterface'>
    <wsdl:operation name='SendCertificateToRecipient'>
      <wsdl:input message='tns:SendCertificateToRecipientRequest'/>
      <wsdl:output message='tns:SendCertificateToRecipientResponse'/>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name='SendCertificateToRecipientResponderBinding' type='tns:SendCertificateToRecipientResponderInterface'>
    <soap:binding style='document' transport='http://schemas.xmlsoap.org/soap/http'/>
    <wsdl:operation name='SendCertificateToRecipient'>
      <soap:operation
              soapAction='urn:riv:clinicalprocess:healthcond:certificate:SendCertificateToRecipientResponder:1:SendCertificateToRecipient'
              style='document'/>
      <wsdl:input>
        <soap:header use='literal' message='tns:SendCertificateToRecipientRequest' part='LogicalAddress'/>
        <soap:body use='literal' parts='parameters'/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use='literal'/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name='SendCertificateToRecipientResponderService'>
    <wsdl:port name='SendCertificateToRecipientResponderPort' binding='tns:SendCertificateToRecipientResponderBinding'>
      <soap:address location='http://tempuri.org'/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
