web/src/test/resources/integrationtests/sendcertificatetorecipient/requests.stg

delimiters "$", "$"

request(data, mottagare) ::= <<
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:riv:itintegration:registry:1" xmlns:urn1="urn:riv:clinicalprocess:healthcond:certificate:SendCertificateToRecipientResponder:1" xmlns:urn2="urn:riv:clinicalprocess:healthcond:certificate:types:3" xmlns:urn3="urn:riv:clinicalprocess:healthcond:certificate:3">
   <soapenv:Header>
      <urn:LogicalAddress>?</urn:LogicalAddress>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:SendCertificateToRecipient>
         <urn1:skickatTidpunkt>2016-05-25T00:00:00</urn1:skickatTidpunkt>
         <urn1:intygs-id>
            <urn2:root>moff</urn2:root>
            <urn2:extension>$data.intygsId$</urn2:extension>
         </urn1:intygs-id>
         <urn1:patientPerson-id>
            <urn2:root>1.2.752.129.2.1.3.1</urn2:root>
            <urn2:extension>$data.personId$</urn2:extension>
         </urn1:patientPerson-id>
         <urn1:mottagare>
            <urn2:code>$mottagare$</urn2:code>
            <urn2:codeSystem>769bb12b-bd9f-4203-a5cd-fd14f2eb3b80</urn2:codeSystem>
            <!--Optional:-->
            <urn2:displayName>?</urn2:displayName>
         </urn1:mottagare>
         <urn1:skickatAv>
            <!--You have a CHOICE of the next 2 items at this level-->
            <urn1:hosPersonal>
               <urn3:personal-id>
                  <urn2:root>1.2.752.129.2.1.4.1</urn2:root>
                  <urn2:extension>SE2321000016-6G5R</urn2:extension>
               </urn3:personal-id>
               <urn3:fullstandigtNamn>?</urn3:fullstandigtNamn>
               <!--Optional:-->
               <urn3:forskrivarkod>?</urn3:forskrivarkod>
               <!--Zero or more repetitions:-->
               <urn3:befattning>
                  <urn2:code>?</urn2:code>
                  <urn2:codeSystem>1.2.752.129.2.2.1.4</urn2:codeSystem>
                  <!--Optional:-->
                  <urn2:displayName>Test Testsson</urn2:displayName>
               </urn3:befattning>
               <urn3:enhet>
                  <urn3:enhets-id>
                     <urn2:root>1.2.752.129.2.1.4.1</urn2:root>
                     <urn2:extension>SE2321000016-H489</urn2:extension>
                  </urn3:enhets-id>
                  <urn3:arbetsplatskod>
                     <urn2:root>1.2.752.29.4.71</urn2:root>
                     <urn2:extension>45312</urn2:extension>
                  </urn3:arbetsplatskod>
                  <urn3:enhetsnamn>zlorg</urn3:enhetsnamn>
                  <urn3:postadress>zlarg</urn3:postadress>
                  <urn3:postnummer>zlurg</urn3:postnummer>
                  <urn3:postort>zlerg</urn3:postort>
                  <urn3:telefonnummer>?</urn3:telefonnummer>
                  <!--Optional:-->
                  <urn3:epost>ve1@vg1.se</urn3:epost>
                  <urn3:vardgivare>
                     <urn3:vardgivare-id>
                        <urn2:root>1.2.752.129.2.1.4.1</urn2:root>
                        <urn2:extension>SE2321000016-39KJ</urn2:extension>
                     </urn3:vardgivare-id>
                     <urn3:vardgivarnamn>Vårdgivaren</urn3:vardgivarnamn>
                     <!--You may enter ANY elements at this point-->
                  </urn3:vardgivare>
                  <!--You may enter ANY elements at this point-->
               </urn3:enhet>
               <!--Zero or more repetitions:-->
               <urn3:specialistkompetens>
                  <urn2:code>nej</urn2:code>
                  <!--Optional:-->
                  <urn2:displayName>inget</urn2:displayName>
               </urn3:specialistkompetens>
               <!--You may enter ANY elements at this point-->
            </urn1:hosPersonal>
            
         </urn1:skickatAv>
         <!--You may enter ANY elements at this point-->
      </urn1:SendCertificateToRecipient>
   </soapenv:Body>
</soapenv:Envelope>
</soapenv:Envelope>
>>
